{
  "activity": {
    "title": "Activity",
    "text": "An activity describes what happened to a specific arm of the study during a specific time period. For example, during the \"treatment phase\", the \"aspirin arm\" might receive \"20 mg/day of aspirin\". In addition to interventions, activities include things such as placebo wash-out and randomization.",
    "link": "/manual.html#study-input"
  },
  "activity-type": {
    "title": "Activity type",
    "text": "The type of the activity. May be an abstract activity such as randomization or screening, a no-intervention period such as wash-out, or a treatment activity in which one or more drugs are supplied.",
    "link": "/manual.html#add-activity"
  },
  "addis-analysis": {
    "title": "Analysis",
    "text": "Analyses can be performed based on the project dataset, for example a network meta-analysis on one of the outcomes of interest. An analysis can consist of multiple models, for example a primary comparative analysis and several models to investigate heterogeneity and inconsistency. Currently, an analysis can be an evidence synthesis (e.g. meta-analysis) or a benefit-risk analysis.",
    "link": "/manual.html#analysis-projects"
  },
  "addis-covariate": {
    "title": "Covariate",
    "text": "A covariate is a study-level variable that may affect the relative treatment effects observed in primary studies. For example, whether the study was randomized or the disease severity at baseline could be covariates. Currently, a covariate can be defined either as one of the studies' design characteristics, or as a baseline characteristic describing the studies' populations.",
    "link": "/manual.html#defining-covariates"
  },
  "addis-intervention": {
    "title": "Intervention",
    "text": "An intervention defines one of the alternative treatments of interest for the project, based on concepts defined in the dataset. Definitions can be simple (e.g. \"drug A\"), or more complex (e.g. \"drug A, dose between 10 and 20 mg/day\").",
    "link": "/manual.html#defining-interventions"
  },
  "addis-outcome": {
    "title": "Outcome",
    "text": "An outcome defines a variable of interest for the project, based on concepts defined in the dataset. Project outcomes are different from dataset outcomes; for example, what was considered an adverse event in primary studies may well be an outcome of interest in your meta-analysis.",
    "link": "/manual.html#defining-outcomes"
  },
  "adverse-event": {
    "title": "Adverse event",
    "text": "An adverse event is an unintended event observed during the study, which may or may not have been caused by the study interventions.",
    "link": "/manual.html#study-input"
  },
  "add-arm": {
    "title": "Adding an arm",
    "text": "These are abstract containers that divide the population into subpopulations, and correspond to that group's flow through the study protocol. You can give these any name you wish, but we recommend            to name them according to the treatment this subpopulation will receive.",
    "link": "/manual.html#add-arm"
  },
  "arm": {
    "title": "Arm",
    "text": "In randomized studies participants are randomized into groups called \"arms\", each of which receives a different intervention. We loosely use this term to also refer to the groups being compared in a comparative cohort study.",
    "link": "/manual.html#study-input"
  },
  "baseline-characteristic": {
    "title": "Baseline characteristic",
    "text": "A baseline characteristic is a variable that is typically measured at the start of the study to describe the enrolled population and/or to assess whether randomization led to adequate balance between the arms of the study. There may be overlap between baseline characteristics and outcomes; when the same variable is measured at baseline and at other times, we recommend encoding it as an outcome.",
    "link": "/manual.html#study-input"
  },
  "benefit-risk-analysis": {
    "title": "Benefit-risk analysis",
    "text": "A benefit-risk analysis is a formal way to assess trade-offs between the favorable and unfavorable effects of treatments. There is a clear separation between objective measurements of treatment effects and subjective value judgments.",
    "link": "/manual.html#benefit-risk-analysis"
  },
  "commit": {
    "title": "Commit",
    "text": "ADDIS tracks all versions of a dataset in the dataset history. After you make changes to a study extraction or the concepts, you \"commit\" to these changes, making them final. When doing so, you provide a short title and optionally a longer description, which serve to document in the dataset history what kind of changes were made and why.",
    "link": "/manual.html#commit"
  },
  "concept": {
    "title": "Concept",
    "text": "Concepts at the dataset level allow the harmonisation of study-level data for cross-study analysis. For example, the study-level concept \"50% or greater improvement on HAM-D\" could be mapped to a concept defined at the dataset level (e.g. \"HAM-D response\")",
    "link": "/manual.html#concept"
  },
  "concept-mapping": {
    "title": "Concept mapping",
    "text": "A concept mapping harmonizes a term used at the study level (e.g. \"50% or greater improvement on HAM-D\"), to a concept defined at the dataset level (e.g. \"HAM-D response\"). Concept mappings enable greater flexibility in re-using study extractions made by others, or for a previous project.",
    "link": "/manual.html#concept"
  },
  "condition": {
    "title": "(Health) condition",
    "text": "The disease or health state being studied.",
    "link": "/manual.html#condition"
  },
  "confidence-interval": {
    "title": "Confidence interval",
    "text": "The interval of within which a certain percentage of the measured outcomes lie.",
    "link": "/manual.html#study-input"
  },
  "copy-study": {
    "title": "Copy study",
    "text": "You can copy studies (including those you don't own) from one dataset to another. Here you can specify which dataset the study should be copied to. Note that if the original study is changed in later versions, yours will not change. Similarly, changing your copy will not affect the original.",
    "link": "/manual.html#dataset-management"
  },
  "count": {
    "title": "Subjects with event",
    "text": "The total number of subjects that experienced the event of interest. May be an adverse event or a dichotomous outcome.",
    "link": "/manual.html#study-input"
  },
  "d80-table": {
    "title": "Summary of efficacy table",
    "text": "Display the Summary of Efficacy Table according to the EMA D80 Clinical report template",
    "link": "http://www.ema.europa.eu/docs/en_GB/document_library/Regulatory_and_procedural_guideline/2009/10/WC500004800.pdf"
  },
  "dataset": {
    "title": "Dataset",
    "text": "A dataset is a collection of studies that are somehow related, e.g. studies identified by a systematic literature review.",
    "link": "/manual.html#dataset-management"
  },
  "dataset-history": {
    "title": "Dataset history",
    "text": "The full history of a dataset, including all dataset versions in between (and including) its initial creation and the very latest update. Individual versions can be viewed to see how a study has changed over time.",
    "link": "/manual.html#version-history"
  },
  "dataset-version": {
    "title": "Dataset version",
    "text": "Whenever changes are made to a dataset and are committed (saved), this creates a new version of the dataset. All previous versions of a dataset are kept in the dataset history.",
    "link": "/manual.html#dataset-version"
  },
  "dose-type": {
    "title": "Intervention dose",
    "text": "Dosed interventions may be of either fixed or titrated dose type. Fixed doses allow you to specify the range that the fixed doses must lie on to match this intervention. In the case of a titrated dose, a range can be specified for both the upper and lower end of the dose. If the project lacks a desired unit to specify the dosage, it can be added from this screen. Matching exactly one dosage value is specified through the lower bound.,",
    "link": "defining-interventions"
  },
  "drug": {
    "title": "Drug",
    "text": "A drug is any substance or treatment that is given to a population in a study",
    "link": "/manual.html#study-input"
  },
  "eligibility-criteria": {
    "title": "Eligibility criteria",
    "text": "The criteria based on which participants were included into, or excluded from, the study.",
    "link": "/manual.html#eligibility-criteria"
  },
  "epoch": {
    "title": "Epoch",
    "text": "A period or phase of the study during which a certain activity (or group of activities) took place. For example, a drug study might consist of a placebo run-in period, a treatment period, and a follow-up period.",
    "link": "/manual.html#study-input"
  },
  "epoch-duration": {
    "title": "Epoch duration",
    "text": "How long an epoch takes. May be instantaneous in the case of abstract epochs such as randomization. For concrete durations we only allow specification of durations in unambiguous units of time, i.e. hours, days, weeks.",
    "link": "/manual.html#add-epoch"
  },
  "event-count": {
    "title": "Number of events",
    "text": "The total number of events observed for the given group. May exceed the number of subjects at risk, if subjects experience more than one event.",
    "link": "/manual.html#study-input"
  },
  "evidence-synthesis": {
    "title": "Evidence synthesis",
    "text": "Evidence synthesis is the statistical combination of estimates from multiple primary studies into an overall pooled estimate. Evidence synthesis techniques include pair-wise meta-analysis, network meta-analysis, and meta-regression.",
    "link": "/manual.html#evidence-synthesis"
  },
  "exposure": {
    "title": "Total observation time",
    "text": "The cumulative amount of time that all subjects in the study were exposed to treatment",
    "link": "/manual.html#study-input"
  },
  "featured-dataset": {
    "title": "Featured dataset",
    "text": "Featured datasets are well structured datasets that serve as examples of some of ADDIS' features. They are highlighted on the home page, and are a good place to start trying out the software. If you think your dataset deserves to be featured on the home page, feel free to [contact us](https://drugis.org/contact).",
    "link": "/manual.html#featured-dataset"
  },
  "first-quartile": {
    "title": "First quartile",
    "text": "The 25% quantile, or the lower end of the inter-quartile range.",
    "link": "/manual.html#study-input"
  },
  "geometric-coefficient-of-variation": {
    "title": "Geometric coefficient of variation",
    "text": "Measure of dispersion appropriate when the log of the observations are normally distributed.",
    "link": "/manual.html#study-input"
  },
  "geometric-mean": {
    "title": "Geometric mean",
    "text": "The geometric mean is appropriate when the log of the observations are normally distributed.",
    "link": "/manual.html#study-input"
  },
  "hazard-ratio": {
    "title": "Hazard ratio",
    "text": "The hazard ratio describes by which factor being in one group is more (or less) hazardous another group. For example a treated population may die at twice the rate per unit time as the control population, yielding a  hazard ratio of 2.",
    "link": "/manual.html#study-input"
  },
  "least-squares-mean": {
    "title": "Least squares mean",
    "text": "A point estimate obtained through least squares estimation (i.e. fitting a stastistical model).",
    "link": "/manual.html#study-input"
  },
  "log-mean": {
    "title": "Log mean",
    "text": "The logarithmic mean.",
    "link": "/manual.html#study-input"
  },
  "max": {
    "title": "Max",
    "text": "The highest value measured in the given group.",
    "link": "/manual.html#study-input"
  },
  "mean": {
    "title": "Mean",
    "text": "The mean (average) value measured in the given group.",
    "link": "/manual.html#study-input"
  },
  "mean-difference": {
    "title": "Mean",
    "text": "The mean difference.",
    "link": "/manual.html#study-input"
  },
  "measurement": {
    "title": "Measurement",
    "text": "A measurement captures the outcome for the participants of each treatment group in the study. Measurements are described at the group (aggregate) level, for example the mean outcome observed in the group or the count of participants for whom an event occurred.",
    "link": "/manual.html#measurement"
  },
  "measurement-moment": {
    "title": "Measurement moment",
    "text": "A measurement moment corresponds to the time when measurements were taken. Measurement moments are relative to certain anchor time points within the study, e.g. the start or the end of the treatment phase.",
    "link": "/manual.html#study-input"
  },
  "measurement-moment-epoch": {
    "title": "Epoch for measurement moment",
    "text": "Measurement moment are defined relative to either the beginning or the end of a specific epoch. They may be either exactly at the end or beginning of the epoch, or take place a certain period after that point.",
    "link": "/manual.html#add-measurement-moment"
  },
  "median": {
    "title": "Median",
    "text": "The median (middle-most) value measured in the given group.",
    "link": "/manual.html#study-input"
  },
  "min": {
    "title": "Min",
    "text": "The lowest value measured in the given group.",
    "link": "/manual.html#study-input"
  }, 
   "odds-ratio": {
    "title": "Odds ratio",
    "text": "The odds ratio",
    "link": "/manual.html#study-input"
  },
  "other-group": {
    "title": "Other group",
    "text": "Any group within the study that is not an arm. This includes the total study population, and may also refer to sub-groups such as all males in the study or all elderly patients in the control arm.",
    "link": "/manual.html#study-input"
  },
  "percentage": {
    "title": "Percentage with event",
    "text": "The total number of subjects that experienced the event of interest, expressed as a percentage of the number at risk (sample size). 'Subjects with event' is preferred to 'Percentage with event' when available.",
    "link": "/manual.html#study-input"
  },
  "population-information": {
    "title": "Population information",
    "text": "A description of how participants were enrolled in the study, including the health condition of interest and the eligibility (inclusion and exclusion) criteria.",
    "link": "/manual.html#study-input"
  },
  "primary-epoch": {
    "title": "Primary epoch",
    "text": "Whether an epoch is the primary (treatment) epoch. Also used by ADDIS to determine which data to select for analysis.",
    "link": "/manual.html#add-epoch"
  },
  "project": {
    "title": "Project",
    "text": "A project is a collection of analyses performed on a specific version of a single dataset. Typically, it aims to answer a specific question or a number of related questions using the dataset.",
    "link": "/manual.html#analysis-projects"
  },
  "proportion": {
    "title": "Proportion with event",
    "text": "The total number of subjects that experienced the event of interest, expressed as a proportion of the number at risk (sample size). 'Subjects with event' is preferred to 'Proportion with event' when available.",
    "link": "/manual.html#study-input"
  },
  "quantile-0.025": {
    "title": "2.5% Quantile",
    "text": "The 2.5% quantile, or the lower end of a 95% confidence interval.",
    "link": "/manual.html#study-input"
  },
  "quantile-0.05": {
    "title": "5% Quantile",
    "text": "The 5% quantile, or the lower end of a 90% confidence interval.",
    "link": "/manual.html#study-input"
  },
  "quantile-0.95": {
    "title": "95% Quantile",
    "text": "The 95% quantile, or the upper end of a 90% confidence interval.",
    "link": "/manual.html#study-input"
  },
  "quantile-0.975": {
    "title": "97.5% Quantile",
    "text": "The 97.5% quantile, or the upper end of a 95% confidence interval.",
    "link": "/manual.html#study-input"
  },
  "reference-row":{
    "title": "Reference row",
    "text": "The row that is the reference for the contrast data",
    "link": "/manual.html#study-input"
  },
  "result-properties": {
    "title": "Result properties",
    "text": "Which properties of this variable were measured, e.g. in the case of a continuous variable the mean and standard error may have been measured, or only certain quantiles may have been reported.",
    "link": "/manual.html#add-variable"
  },
  "risk-ratio": {
    "title": "Risk ratio",
    "text": "The risk ratio.",
    "link": "/manual.html#study-input"
  },
  "sample-size": {
    "title": "N",
    "text": "The sample size, N. For dichotomous outcomes, this encodes the number of subjects at risk. For continuous outcomes, it is the number of subjects for which the outcome is measured (or intended to be measured).",
    "link": "/manual.html#study-input"
  },
  "semantic-outcome": {
    "title": "Semantic outcome",
    "text": "The dataset concept to which this outcome corresponds.",
    "link": "/manual.html#defining-outcomes"
  },
  "semantic-intervention": {
    "title": "Semantic intervention",
    "text": "The dataset concept to which this intervention corresponds.",
    "link": "/manual.html#defining-interventions"
  },
  "standard-deviation": {
    "title": "Standard deviation",
    "text": "The standard deviation measured the amount of variation in the given sample. It is the square root of the average of the squared deviations from the mean.",
    "link": "/manual.html#study-input"
  },
  "standard-error": {
    "title": "Standard error",
    "text": "The standard error of the mean describes the residual uncertainty around the mean. It is the standard deviation divided by the square root of the sample size.",
    "link": "/manual.html#study-input"
  },
  "standardized-mean-difference":{
    "title": "Standardized mean difference",
    "text": "The standardized mean difference",
    "link": "/manual.html##study-input"
  },
  "study": {
    "title": "Study",
    "text": "A study extraction is a detailed description of a comparative study, typically a randomized controlled trial or a comparative cohort design.",
    "link": "/manual.html#creating-a-study"
  },
  "study-design": {
    "title": "Study design",
    "text": "The study design table captures which activities were applied to each arm during each of the time periods of the study.",
    "link": "/manual.html#study-input"
  },
  "study-history": {
    "title": "Study history",
    "text": "The full history of a study, including all dataset versions in between (and including) its initial creation and the very latest update. Individual versions can be viewed to see how a study has changed over time.",
    "link": "/manual.html#version-history"
  },
  "study-information": {
    "title": "Study information",
    "text": "Study information contains basic descriptives of the study. Some are structured, such as randomization and blinding, while others are free text.",
    "link": "/manual.html#study-input"
  },
  "third-quartile": {
    "title": "Third quartile",
    "text": "The 75% quantile, or the upper end of the inter-quartile range.",
    "link": "/manual.html#study-input"
  },
  "treatment-drugs": {
    "title": "Treatment drugs",
    "text": "Which drugs are supplied in this treatment. NB: To indicate that different drugs are supplied to different arms, create multiple treatment activites, not a single activity with multiple drugis (that makes it a combination treatment).",
    "link": "/manual.html#add-activity"
  },
  "trialverse-outcome": {
    "title": "Outcome",
    "text": "An outcome is a pre-specified quantity of interest in the study. It is intended to be compared between arms after the study interventions have been administered.",
    "link": "/manual.html#study-input"
  },
  "unit": {
    "title": "Unit",
    "text": "An unit of measurement, e.g. gram, liter, meter. Used to define quantities of treatment doses.",
    "link": "/manual.html#defining-units"
  },
  "variable": {
    "title": "Variable",
    "text": "A variable is an event or change that is measured in a population during a study, either a baseline characteristic (e.g. \"age\"), an outcome (e.g. \"mood improvement\"), or an adverse event (e.g. \"nausea\").",
    "link": "/manual.html#study-input"
  }
}
